Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The properties frame colour for unlocked items in the room editor
zh_cn: 房间编辑器未锁定项的属性框颜色

source: The radius of the disk on the grid.
zh_cn: 栅格中圆盘的半径

source: The release notes are split into two different sets due to the fact that both the IDE and the actual Runtimes can be updated independently.
zh_cn: 发行信息分为两组，因为IDE和实际运行环境会独立更新。

source: The render target index to use (from 0 to 3).
zh_cn: 渲染目标的索引 (从 0 到 3)。

source: The request was cancelled before completion.
zh_cn: 该请求在完成之前被取消。

source: The resource you are trying to import is not compatible with this project version.
zh_cn: 尝试导入的资源和现在的项目版本不兼容。

source: The rest of the Start Page is explained in the sections below:
zh_cn: 下面的章节将说明起始页的其它内容：

source: The rest of the general options are related to the different colours that are used throughout the room editor interface, and if you double click on any of the swatches you can edit the colour for that setting.
zh_cn: 其余的常规选项与整个场景编辑界面中使用的不同颜色有关，您双击任一色板，都可以编辑该设置的颜色。

source: The right edge of the rectangle to check
zh_cn: 矩形的右边界。

source: The right hand side also shows the different status icons which are as follows:
zh_cn: 右边也显示了不同的状态图标，如下：

source: The right position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的右端位置

source: The rules are the same no matter what the value being expressed is - each number is created from adding multiple bits together.
zh_cn: 不管表示的值是什么，规则都是一样的 - 每个数字由多个位加在一起构成。

source: The runtime feed options are given below for Master, but they will be the same for any others:
zh_cn: 以下给出了主要的运行库下载源选项，对于其它的来说也是一样的：

source: The same goes if you supply more arguments than you require.
zh_cn: 同时，提供的参数数量超过需要的也会报错。

source: The scale to fit option has been selected on a gadget with no parent, try removing the scale to fit option
zh_cn: 已在没有父项的部件上选择了“适合比例缩放”选项，请尝试删除“适合比例缩放”选项

source: The script above simply checks all the instances in a room to see what their object_index is and if one of them is the player object the script will return true (ending the script) or false.
zh_cn: 上述脚本会直接检测房间内所有实例来观察它们的object_index是多少并且如果它们当中有一个和玩家相同的时候脚本会返回true或false（并结束脚本）

source: The script itself is something simple like:
zh_cn: 脚本内容：

source: The second angle to use.
zh_cn: 待使用的第二个角。

source: The second matrix index to use.
zh_cn: 所使用的第二个矩阵索引

source: The second way it works is when you add code or DnD™ to it.
zh_cn: 第二种方式是当你添加代码或 DnD™ 时。

source: The sections below cover the different ways that you can debug your game:
zh_cn: 以下内容为你可使用的调试游戏的不同方式：

source: The sections listed below are all related to setting up GameMaker Studio 2 , including updating the IDE and Runtimes, the required SDKs for specific target modules, and the General Preferences to adapt how GameMaker Studio 2 works to suit your own style of doing things.
zh_cn: 本章节在下面列举了所有关于安装部署GameMaker Studio 2的内容，包括更新IDE和运行环境，对于特定目标平台模块所必需的SDK以及常规的偏好设置来让GameMaker Studio 2的工作方式适配你自己的风格。

source: The selected image is too large to display
zh_cn: 所选图像太大，无法显示

source: The selected layer does not accept the dragged resources, please select an appropriate layer type, ie.
zh_cn: 所选图层不接受拖动的资源，请选择合适的图层类型。

source: The selected runtime could not fully install
zh_cn: 选定的运行库无法完全安装

source: The selected tile set has no associated sprite please select a valid tile set
zh_cn: 选中的图块集没有关联的精灵，请选择一个有效的图块集

source: The selection bound colour for all locked or unlocked items in the room editor
zh_cn: 房间编辑器所有锁定项选框边界颜色

source: The selection bounds colour for all unlocked items in the room editor
zh_cn: 房间编辑器所有未锁定项选框边界颜色

source: The selection frame colour for locked items in the room editor
zh_cn: 房间编辑器锁定项的选框颜色

source: The selection frame colour for unlocked items in the room editor
zh_cn: 房间编辑器未锁定项的选择框颜色

source: The shader '{0}' has an invalid type.
zh_cn: 着色器 '{0}' 具有一个无效的类型?。

source: The size (in bytes) of the data.
zh_cn: 数据大小（字节形式）。

source: The size of the array to create.
zh_cn: 待创建的数组大小

source: The smoothness of the chain.
zh_cn: 链条连线的平滑度

source: The sound window also has other options which are explained below.
zh_cn: 声音窗口还有如下选项。

source: The source code in {0} has been modified and cannot be debugged.
zh_cn: {0}中的源代码已被修改，无法进行调试。

source: The specific event constant or value, if one is necessary (otherwise, just use 0).
zh_cn: 在必要时指定具体事件的常量或值（否则用0即可）。

source: The specific event, if one is necessary (otherwise, just use 0).
zh_cn: 在必要时指定具体的事件的常量或值（否则用0即可）。

source: The speed difference is negligible for smaller arrays, but larger ones should be optimised as much as possible in this way.
zh_cn: 对于较小的数组，速度差异可以忽略不计，然而较大的数组应该尽可能地以这种方式优化。

source: The standard way of doing this in GameMaker is to put actions in mouse or keyboard events, but sometimes you need more control, especially when creating something for mobile devices or HTML5.
zh_cn: 在 GameMaker 中通常的做法是在鼠标或按键事件中放置动作，但有时你需要更多的控制，尤其是移动设备或 HTML5。

source: The starting x position within the surface.
zh_cn: 表面层内的起始x位置

source: The starting y position within the surface.
zh_cn: 表面层内的起始y位置。

source: The statement (which can also be a code block) is executed until the expression is found true, and the initial statement is always executed at least once.
zh_cn: 语句（也可以是代码块）会一直运行直到表达式为真，至少会运行一次。

source: The statement is repeated the number of times indicated by the rounded value of the expression.
zh_cn: 语句（statement）被重复执行的次数由表达式（expression）的近似值指定。

source: The structure of the given statement is incorrect.
zh_cn: 给定语句的结构是不正确的。

source: The style '{0}' is not a valid json primitive.
zh_cn: 样式'{0}'不是有效的json基元(?)。

source: The style name '{0}' is currently registered to\n'{2}'\nbut will now be saved to\n'{1}'
zh_cn: 样式名称 '{0}' 当前已经注册给\n'{2}'\n但是现在将保存到\n'{1}'

source: The style wasn't found in this folder.
zh_cn: 文件夹中没有发现样式文件。

source: The surface must be saved as a *.png format file, and the (x,y) position must be given as local coordinates to the surface, bearing in mind that the top left corner of the surface is always (0,0).
zh_cn: 表面层 只能 保存为 *.png 格式的文件，给定的 (x,y)坐标必须是表面层的局部坐标，铭记的表面的左上角总是（0,0）。

source: The surface must be saved as a *.png format file.
zh_cn: 表面层 只能 保存为 *.png 格式文件。

source: The surface_id is that of a surface you have created previously, or the application_suface, and the function will resize that surface.
zh_cn: 这个 surface_id 是之前创建好的表面层，或者是application_suface，这个函数将重置表面层的大小。

source: The tag name {0} is reserved and cannot be used.
zh_cn: 标记名{0}是预留的，不能使用。

source: The target platform available will depend on the version of the IDE that you bought (Creator for macOS or Creator for Windows) and will use the VM (a runner + interpreted code) to run and build your games.
zh_cn: 可用的目标平台将取决于您购买的IDE版本 (Creator for macOS 或 Creator for Windows) 并使用 VM (运行器+解释代码) 运行你的游戏。

source: The texture at path '{0}' ({1}x{2}) exceeds the maximum supported dimension ({3}x{3}) and cannot be loaded.
zh_cn: 路径 '{0}' 的纹理 ({1}x{2}) 超过最大支持的尺寸 ({3}x{3}) ，不能加载。

source: The tile set preview will appear here when you select a sprite
zh_cn: 当您选定一个精灵时会显示图块组的预览

source: The time in milliseconds to hold the mouse down to drag nodes.
zh_cn: 按住鼠标到拖动节点所需的时间(毫秒)。

source: The time in milliseconds to lock scrolling to a gadget
zh_cn: 锁定部件滚动状态的时间（毫秒）

source: The top bar of the Start Page contains a number of links to make navigating easier.
zh_cn: 起始页的顶栏包含许多图标链接，使浏览更容易。

source: The top edge of the rectangle to check.
zh_cn: 矩边的顶部边界。

source: The top position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的顶端位置

source: The transition specified '{0}' is not valid
zh_cn: 指定转换 '{0}' 无效

source: The transparency of the colour with which the screen will be cleared
zh_cn: 用来填充屏幕的颜色的透明度

source: The tutorials/demos sections of the Start Page also has a couple of buttons to help you better use and navigate your assets:
zh_cn: 在起始页的教程演示部分也有几个按钮，帮助您更好的使用和浏览您的资产:

source: The type of event to perform.
zh_cn: 要执行的事件类型。

source: The type of server to create (see the constants listed below).
zh_cn: 要创建的服务器类型（详见以下常量表）。

source: The type of window that you choose to open will depend on what it is that you wish to watch, with the following options available:
zh_cn: 你选择的窗口的类型取决于你想要监视什么，有下列可选项：

source: The types of image that you can select from are *.png, *.gif, *.jpg, *.jpeg, *.tif, *.tiff, *.ico, *.bmp, *.2bp or *.mdi, but note that regardless of initial image format, all files will be saved out for use as *.png files, so animated *.gif files for example will only be rendered as a single initial frame.
zh_cn: 你可以选择的图像种类有*.png、*.gif、*.jpg、*.jpeg、*.tif、*.tiff、*.ico、*.bmp、*.2bp以及*.mdi，但是请注意，无论初始的文件格式如何，所有被使用的文件都会被另存为*.png文件，因此动画*.gif文件只会被渲染成一张单初始帧图像。

source: The url or IP to connect to (a string).
zh_cn: 待连接的URL或IP（字符串形式）。

source: The use of this surface means that you can easily create incredible transitions using shaders, or take the screen and wrap it around a 3D form, or simply scale a low-res game up to any resolution screen...
zh_cn: 使用这个表面层意味着你可以轻松地过渡到使用着色器，采集屏幕用并3D模式环绕，或者简单的缩放低分辨率的游戏到任意分辨率的屏幕上。

source: The value is a colour (allows expressions)
zh_cn: 值是颜色（允许表达式）

source: The value is a real number and accepts decimal places (allows expressions)
zh_cn: 该值是实数并接受小数位（允许表达式）

source: The value is a resource (allows expressions)
zh_cn: 值是资源（允许表达式）

source: The value is a string (quotes are optional)
zh_cn: 值是字符串（引号可选）

source: The value is a whole number (allows expressions)
zh_cn: 值是整数（允许表达式）

source: The value is any code expression
zh_cn: 值是任意的代码表达式

source: The value is either true or false
zh_cn: 值为true或false

source: The value is one or more expressions from a list (if multi-select is on then\nthis is an array of expressions)
zh_cn: 值是来自列表中的一个或多个表达式（如果多选，则表示\n这是一排表达式）

source: The value to add to the cell.
zh_cn: 待叠加到单元格的值

source: The value to add to the cells within the disk.
zh_cn: 待叠加给圆盘内单元格的值

source: The value to add to the region cells.
zh_cn: 待叠加到区域单元格的值。

source: The value to be added must be of the same type as that held within the grid cells, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 这个待叠加的值必须和这些栅格的单元格中所承载的值是同一类型，比如：你不能把一个字符串叠加给一个实数，反之亦然，并且对于字符串来说这相当于串接

source: The value to be added must be the same type as that held within the grid cell, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 这个待叠加的值必须和栅格内单元格所承载的值是同一类型，比如你不能把一个字符串叠加给一个实数，反之亦然，并且对于字符串来说，这相当于串接。.

source: The value to use to initialise all array indices (optional).
zh_cn: 用于初始化所有数组元素的值（可选）

source: The way that the tilemap for the room is stored in GameMaker Studio 2 means that tile (0) will always need to be blank as it's essentially the "delete" tile or the "empty space" tile.
zh_cn: GameMaker Studio 2 中存储房间的地图的方式意味着（0）总是 需要空白的，因为它本质代表了“删除”或“空白”。

source: The width of the anchor points
zh_cn: 锚点的宽度

source: The width of the area in the source surface to copy from.
zh_cn: 源表面层内，复制区域的宽度。

source: The width of the area of the screen to capture
zh_cn: 捕捉屏幕区域的宽度。

source: The width of the new surface.
zh_cn: 新表面层的宽度。

source: The width of the part to save.
zh_cn: 保存部分的宽度。

source: The width of the surface to be created.
zh_cn: 创建的表面层的宽度。

source: The windows that can be opened from here are the Resources window and all the different Output windows (Output, Search, SCM, Breakpoints and Compile/Syntax Errors).
zh_cn: 可以从这里打开的窗口有 资源 窗口和不同的 输出 窗口（输出，搜索，SCM，断点和编译/语法错误）。

source: The windows that can be opened from here are the Resources window and all the different Output windows.
zh_cn: 在这里你可以打开的是资源窗口以及各种输出窗口。

source: The x coordinate in the display.
zh_cn: 显示器上的x坐标。

source: The x coordinate in the window.
zh_cn: 窗口内的x坐标

source: The x coordinate of the first component of the vector
zh_cn: 向量组件的第一个x坐标

source: The x coordinate of the pixel to check
zh_cn: 表面上的x坐标，用于获取对应的像素。

source: The x coordinate of the second component of the vector
zh_cn: 向量组件的第二个x坐标

source: The x coordinate of the top left corner of the area of the screen to capture
zh_cn: 捕捉屏幕区域的左上角X坐标。

source: The x coordinate of where to position the window.
zh_cn: 窗口位置的x坐标。

source: The x position in the source surface to copy from.
zh_cn: 源表面层内，复制区域的x坐标。

source: The x position of the cell in the grid.
zh_cn: 栅格内单元格的x位置

source: The x position of the disk on the grid.
zh_cn: 栅格内圆盘区域x位置。

source: The x position of the left of the region in the grid.
zh_cn: 栅格内区域左端x位置。

source: The x position of the right of the region in the grid.
zh_cn: 栅格内区域右端x位置。

source: The x position on the destination grid to add the source region to.
zh_cn: 待叠加给的靶栅格上的x位置

source: The x position on the surface from which to get the pixel.
zh_cn: 表面上的x坐标，用于获取对应的像素。

source: The x position to copy to.
zh_cn: 目的表面层指定的x坐标，从源表面层复制到这个位置。

source: The y coordinate in the display.
zh_cn: 显示器上的y坐标。

source: The y coordinate in the window.
zh_cn: 窗口内的y坐标

source: The y coordinate of the first component of the vector
zh_cn: 向量组件的第一个y坐标

source: The y coordinate of the pixel to check
zh_cn: 表面上的y坐标，用于获取对应的像素。

source: The y coordinate of the second component of the vector
zh_cn: 向量组件的第二个y坐标

source: The y coordinate of the top left corner of the area of the screen to capture
zh_cn: 捕捉屏幕区域的右上角Y坐标。

source: The y coordinate of where to position the window.
zh_cn: 窗口位置的x坐标。.

source: The y position in the source surface to copy from.
zh_cn: 源表面层内，复制区域的y坐标。

source: The y position of the bottom of the region in the grid.
zh_cn: 栅格内区域底端的y位置。

source: The y position of the cell in the grid.
zh_cn: 栅格内单元格的y位置

source: The y position of the disk on the grid.
zh_cn: 栅格内圆盘区域的y位置。

source: The y position of the top of the region in the grid.
zh_cn: 栅格内区域顶端的y位置。

source: The y position on the destination grid to add the source region to.
zh_cn: 待叠加给的靶栅格上的y位置<

source: The y position on the surface from which to get the pixel.
zh_cn: 表面上的y坐标，用于获取对应的像素。

source: The y position to copy to.
zh_cn: 目的表面层指定的y坐标，从源表面层复制到这个位置。

source: There are a few functions associated with the use of arrays too.
zh_cn: 下面有一些数组相关的函数。

source: There are a few functions designed to help you when dealing with instance or global variables (primarily for use with Compatibility Scripts for imported projects and the code for Drag and Drop actions, but they can be used elsewhere too):
zh_cn: 有一些函数被设计出来用于帮助你处理实例的（Instance）或全局的（Global）变量（基本用于所导入工程的兼容性脚本（Compatibility Scripts）以及由拖拽按钮动作转换的代码中，但它们也可以被用于其他地方）：

source: There are a huge number of keyboard shortcuts available for GameMaker Studio 2, and although most of them are marked in the IDE beside the menu items that they relate too, not all of them are or are obvious to the user at the start.
zh_cn: 在 GameMaker Studio 2 有很多可供使用的键盘快捷键，并且尽管它们当中的绝大多数在IDE中相关菜单项的旁边被标注出来了，但对于用户来说并不是所有快捷键在开始的时候很显眼。

source: There are a number of different types of statements and functions, which are discussed at length in subsequent sections of the manual.
zh_cn: 语句和函数分为多种，分别在帮助文件的不同章节加以说明。

source: There are a number of sub tabs in this window related to Source Control, Searching and debugging, with the initial tab being for the console/compiler output, which shows you what is happening when you are compiling a game for testing or when creating a final package for distribution.
zh_cn: 此窗口中有许多子选项卡用于 源代码控制，搜索 以及 调试，初始选项卡用于控制台/编译器输出，显示当您编译的游戏进行测试或数据最终打包分发时发生了什么。 。

source: There are also a couple of special functions that can be used to save the display, or part of it, to an image file:
zh_cn: 也有多个特别的函数用来全屏或部分截图，保存为图片文件：

source: There are also a great number of keyboard shortcuts that can be used to navigate around the different workspace elements and resource editors, and although you can find a complete list here we'll quickly go through some of the most important ones:
zh_cn: 还有很多可以用于在不同工作区元素及资源编辑器内来回导航键盘快捷键，并且你还可以在这里找到快捷键完整列表，但我们还是会在这里先看几个比较重要的。

source: There are also additional tools for creating Paths, Timelines, Shaders and a whole lot more.
zh_cn: 还有一些额外的工具，用于创建 路径、 时间轴、 着色器以及其它更多的东西。

source: There are also three deprecated built in global variables which you should be aware of (these variables are only designed to support legacy projects from previous versions of GameMaker and should not be used in new projects):
zh_cn: 要注意，还有三个不提倡用的内置全局变量（这三个变量仅用于支持从GameMaker前代版本中导入的传统项目，不要再新版本的项目中使用）：

source: There are conflicts within this project.
zh_cn: 这个项目中存在冲突。

source: There are different types of array available to you to use in GML and they are outlined in the sections below:
zh_cn: 您可以在 GML 中使用不同类型的数组，下面的部分概述了这些数组：

source: There are many cases when you may want to do this, for example in a collision with a bullet object, you may want to find out how much damage the bullet does by accessing a variable in the bullet, or you might want to stop the motion of all the balls in a puzzle , or you might want to move the main character to a particular position, or any number of other situations you typically come across in any game.
zh_cn: 在很多情况下你需要做到这一点，比如子弹的一次碰撞中，你可能想要通过访问了弹的变量知道子弹造成了多少伤害，或者你想要在谜题中让所有的球停下来，或者你想要将主角移动到特定地点，或任何你可能会在其它游戏中遇到的任何情况。

source: There are more results available...
zh_cn: 还有更多结果...

source: There are multiple different Draw Events within the draw event category, but the one you use most is the one at the top simply called "Draw".
zh_cn: 绘图事件类别中有多个不同的绘图事件，但最常用的绘图事件是顶部的绘图事件，简称为“绘制”。

source: There are no breakpoints to display.\nTo place one, press F9 on the desired line in a code editor.
zh_cn: 没有可显示断点。\n如果需要设置，请在代码编辑器指定行按F9。

source: There are no commits to pull.
zh_cn: 没有可拉取的提交内容。

source: There are no commits to push
zh_cn: 没有可推送的提交内容。

source: There are no compile errors to show!
zh_cn: 暂无编译错误

source: There are no syntax errors detected!
zh_cn: 没有监测到语法错误！

source: There are too many Sound Mixer Groups on this window.
zh_cn: 窗口中混音器组过多。

source: There are unsaved changes.
zh_cn: 有未保存的更改。

source: There are various different licence types that you can get for GameMaker Studio 2, the choice of which will depend largely on the audience that you want to target as well as on whether you just want to have some fun making games or wish to sell them and distribute them as well.
zh_cn: 你可以获取 GameMaker Studio 2 的各种不同的许可类型，其选择方式在很大程度上取决于你的输出目标、你只是想做一些有趣的游戏又或者是希望出售游戏。

source: There are various different licence types that you can get for GameMaker Studio 2, the choice of which will depend largely on the audience that you want to target.
zh_cn: GameMaker Studio 2有许多不同的许可信息类型，选择哪一个在于导出平台的受众是什么。

source: There is a default image supplied and it is enabled by default, but you can select your own image here.
zh_cn: 这里会提供一张默认图像，并且默认状态下是启用的，但是你也可以在这里选择你自己的图像。

source: There is a drop-down window here where you can select from a default list of layouts, or you can click the box and input your own value.
zh_cn: 在下拉菜单中你可以选择一个布局的默认列表，或者你可以点击输入框输入你需要的值。

source: There is a section at the top of the resource tree titled Views which enables you to set up one or more custom resource trees to show only the parts of the project that you wish to work on at a time, or to organise your project in a different way, for example per-level.
zh_cn: 资源树顶部有一个名为 Views 的区域，它使您能够设置一个或多个自定义资源树，以便每次只显示您要处理的项目部分，或者以不同的方式显示，例如分级。

source: There is also a function to check if a value is a pointer (see "Checking Data Types", below) and a function to convert a value into a pointer:
zh_cn: 还有一个用于检测一个值是否为指针的函数（参见下文的“数据类型检测”），以及一个能够将值转换为指针的函数

source: There is also the option to open the Environment Variables window where you can see the different paths that the various environment variables used in the Preferences point to.
zh_cn: 还有一个选项可以打开环境变量（Environment Variables）窗口，在这里你可以查看在偏好设置中所引用的各种不同的路径环境变量。

source: There is no Git identity set under Preferences.\nPlease set one so that commits are correctly attributed!
zh_cn: 在“偏好设置”下没有设置Git标识。\n请设置一个以便正确归属提交！

source: There is no Git repository configured with this Project.\nTry Create if you want a local repository, or Import into an existing one.
zh_cn: 这个项目没有配置Git库。\n如果你想要要一个本地存储库，请尝试创建或者导入一个现有的库。

source: There is no SLIM data configured.
zh_cn: 没有配置SLIM数据。

source: There is no buffer associated with identifier {0}
zh_cn: 没有与标识符{0}关联的缓冲区

source: There may have been undetected changes, would you like to reload the project or save?
zh_cn: 可能还有未被发现的更改，你想重新加载目还是保存？

source: There may have been undetected changes, would you like to reload the project?
zh_cn: 可能有未被发现的更改，你想要重新加载项目吗？

source: There were no Amazon Fire devices detected.
zh_cn: 未检测到 Amazon Fire 设备。

source: There will be certain instances in a physics based game which you want to move around but do not wish to be acted on by forces such as gravity, nor forces incurred by collisions with dynamic objects (think of moving platforms in a platform game, for example).
zh_cn: 基于物理的游戏将会有一些你想要移动的实例，但不希望被诸如重力等力量所影响，也不希望与动态对象碰撞所产生的力量（例如，在平台游戏中考虑移动平台）。

source: Therefore this chapter explains the different types and what they can be used for.
zh_cn: 因此，本章将会解释各种不同的类型以及它们都可以被用于做什么。

source: Therefore we now need to draw the surface to the screen in the Draw GUI event like this:
zh_cn: 因为现在需要在 Draw GUI 事件中，像这样绘制这个表面到屏幕上：

source: Therefore, if you have something like this:
zh_cn: 因此，如果代码这样写：

source: These are configured by changing the following parameters:
zh_cn: 这些通过更改以下参数进行配置：

source: These are designed to give you flexibility in your code, and will permit you to create more functional and dynamic arrays when making your games.
zh_cn: 允许你在代码设计中更为灵活，在制作游戏中更好的创建功能强大的动态数组。

source: These are explained briefly below:
zh_cn: 以下为简要说明：

source: These built-in variables are used to define the position of the instance when placed in the game room, the animation speed, the direction of movement and a whole host of other things.
zh_cn: 这些内置变量用于定义实例放置在游戏室中的位置，动画速度，移动方向以及其他一些内容。

source: These buttons are:
zh_cn: 这些按钮是：

source: These buttons can be found at the top of the IDE and represent many of the most common commands that you'll be using while working in GameMaker Studio 2 to make your workflow smoother (note most of these buttons have an equivalent menu option too):
zh_cn: 这些按钮可以在IDE 的顶部找到，代表了许多最常用的命令，您在 GameMaker Studio 2 中可以使用，以使您的工作更加顺滑（注意这些按钮中的大多数也有等效的 菜单选项）：

source: These can be passed into GameMaker Studio 2 from an extension and then checked using the appropriate is_ function, listed at the bottom of this page.
zh_cn: 这些其它类型的数值可以从一个扩展中传递到GameMaker Studio 2中，然后可以使用下面所列举的相应的is_函数来检测它们的类型。

source: These characters are not in this font:
zh_cn: 这些字符不在这个字体中：

source: These contain detailed information on the changes that have been made as well as a complete list of all the bugs that have been fixed.
zh_cn: 这些信息包含了每个版本所改动的细节以及被修复的Bug的完整列表。

source: These days however, with the power of even the most average PC, you no longer have to know any of this and you can do things the long way, since the speed of the machine and its more complex CPU construction will make up for any short comings this approach has.
zh_cn: 然而今天，甚至是使用最普通的 PC，你也不再需要了解这些东西，或者走一个很长的路，机器的速度和结构复杂的 CPU 将弥补这种方法的任何缺点。

source: These different types of values being used are called data types and when using GML they can be any of the following:
zh_cn: 这些值所使用的的不同类型就被称为数据类型（Data Types）并且当使用GML时候，它们可以是下述几种类型：

source: These errors will be caught by GameMaker Studio 2 as the game is being compiled or run and a window will open with the error given as well as where the error was found.
zh_cn: 此类错误在编译或运行时会被 GameMaker Studio 2 捕获，捕获时，会弹出错误提示窗，提示窗中显示了错误内容，以及错误的位置。

source: These events "override" the parent events, meaning that whenever an event for the child object contains actions, these are executed instead of the actions contained in the event of the parent.
zh_cn: 这些事件“覆盖”父事件，这意味着每当一个子对象的事件包含操作时，这些事件将被执行，而不是父事件中包含的操作。

source: These executables can be configured to run on one of three UWP platforms:
zh_cn: 可以将这些可执行文件配置在三个UWP平台之一运行：
